Repository: OSGeo-jp/OSGeoLive-doc-omegat
Catalog: tm/overview--istsos_overview.tmx
Source language: en
Languages: ja

source: Data Management Tool
ja: データ管理ツール

source: istSOS is sensor data management tool that allows collection, maintenance and publishing of monitoring observations using the Open Geospatial Consortium (OGC) |SOS| standard.
ja: istSOSはセンサーデータ管理ツールで、オープン地理空間コンソーシアム(OGC) |SOS| 標準を使用したモニタリング観測の収集、メンテナンス、および公開を可能にします。

source: istSOS strictly implements the SOS 1.0.0 standard, and has passed the OGC CITE (Compliance + Interopability Testing + Evaluation) units tests.
ja: istSOSはSOS1.0.0標準を厳密に実装しており、OGC CITE(Compliance+Interopability Testing+Evaluation)ユニットテストに合格しています。

source: Core Features
ja: 主要機能

source: Publish sensor data in accordance with the Sensor Observation Service (SOS) standard.
ja: Sensor Observation Service (SOS)標準に従ってセンサーデータを公開する。

source: Administer sensors and data with an intuitive web-based interface.
ja: 直感的なWebベースのインターフェイスでセンサーとデータを管理します。

source: Use a complete RestFul API to access istSOS functionality from external clients to create interactive charts, display sensor on a dynamic map or just write some maintenance scripts.
ja: 完全なRESTful APIを使用して、外部クライアントからistSOS機能にアクセスし、インタラクティブなチャートを作成したり、動的な地図にセンサーを表示したり、メンテナンススクリプトを記述したりできます。

source: Get notified through mail, twitter or other social media when sensor data meets specific conditions.
ja: センサーデータが特定の条件を満たした場合、メール、Twitter、その他のソーシャルメディアを通じて通知されます。

source: User authentication and authorization with different access levels (administrator, network manager, data manager and visitor).
ja: 異なるアクセスレベル(管理者、ネットワーク管理者、データマネージャ、訪問者)でのユーザ認証

source: Create Virtual Procedures that look like normal stations but whose data results from on-the-fly elaboration of other sensor data.
ja: 通常のステーションに似ているが、そのデータが他のセンサーデータのオンザフライで生成される仮想プロシージャを作成します。

source: Associate quality indexes to each observation thanks to embedded validation tests.
ja: 埋め込み妥当性テストにより、各観測に品質指数を関連付ける。

source: Online editing of data with a seamless interface and advanced observation calculator.
ja: シームレスなインターフェイスと先進的な観測計算機によるデータのオンライン編集

source: Implemented Standards
ja: 実装されている標準規格

source: SOS 1.0.0: Basic and Transactional profiles
ja: SOS1.0.0:基本プロファイルとトランザクションプロファイル

source: Details
ja: 詳細

source: **Website:** http://istsos.org
ja: **Webサイト:** http://istsos.org

source: **Licence:** GNU General Public License (GPL) version 2
ja: **ライセンス:** GNU General Public License (GPL) version 2

source: **Software Version:** |version-istsos|
ja: **ソフトウエアバージョン:** |version-istsos|

source: **Supported Platforms:** Linux, Unix, Mac, Windows
ja: **対応プラットフォーム:** Linux, Unix, Mac, Windows

source: **API Interfaces:** Python / wsgi
ja: **API インターフェイス:** Python / wsgi

source: **Support:** https://groups.google.com/forum/#!forum/istsos
ja: **サポート:** https://groups.google.com/forum/#!forum/istsos

source: Quickstart
ja: クイックスタート

source: :doc:`Quickstart documentation <../quickstart/istsos_quickstart>`
ja: :doc:`クイックスタート文書 <../quickstart/istsos_quickstart>`
